[
	{
		"title": "I Was Born",
		"time": "1999"
	},
	{
		"title": "Initialization",
		"time": "2009",
		"description": "<p>I first got into programming with <a href=\"https://en.wikipedia.org/wiki/Visual_Basic\">Visual Basic</a> by following resources I could find online in my free time.</p><p>Shortly after, I learned <a href=\"https://en.wikipedia.org/wiki/Logo_%28programming_language%29\">LOGO</a> which was the first programming language I got a proper and in-depth understanding of.</p><p>This early start helped me develop good foundation for other programming languages down the line.</p>"
	},
	{
		"title": "Mining and Crafting",
		"time": "2012",
		"description": "<p>I started writing mods for <a href=\"https://www.minecraft.net\">Minecraft</a> in <a href=\"https://www.java.com\">Java</a>.</p><p>Mod development helped me with learning about VCS and conventions.</p><p>Quick iteration over different setups and no requirement for finishing projects gave an opportunity to learn good project management.</p>"
	},
	{
		"title": "Scaling to Kotlin",
		"time": "2014",
		"description": "<p>As I found abstraction very useful, I went on to learn <a href=\"https://scala-lang.org/\">Scala</a> because I was missing it's trait system while developing in Java.</p><p>I finally landed on <a href=\"https://kotlinlang.org/\">Kotlin</a> as my go to language for <a href=\"https://en.wikipedia.org/wiki/Java_virtual_machine\">JVM</a> because it cleaned up a lot of legacy in Java that were left from it's evolution over the years.</p>"
	},
	{
		"title": "Assemble All the Things",
		"time": "2016",
		"description": "<p>During my high school education I learned some fundamentals of <a href=\"https://en.wikipedia.org/wiki/Assembly_language\">asassembly</a>, <a href=\"https://en.wikipedia.org/wiki/C_(programming_language)\">C</a> and <a href=\"https://en.wikipedia.org/wiki/C%2B%2B\">C++</a>.</p><p>At this point I had a basic understanding of how code works at a lower level. Around this time I also started toying with Linux and FOSS.</p>"
	},
	{
		"title": "Android's Jamming",
		"time": "2017",
		"description": "<p>I started developing an Android application as my high school final project.</p><p>It was a music player inspired by Spotify, that allowed streaming music from YouTube and local storage in background.</p>"
	},
	{
		"title": "Going Learning",
		"time": "2018",
		"description": "<p>I fiddled around with programming language <a href=\"https://golang.org/\">Go</a> and wrote a few small <a href=\"https://en.wikipedia.org/wiki/Command-line_interface\">CLI</a> tools.</p>"
	},
	{
		"title": "Reacting to Complexity",
		"time": "2018",
		"description": "<p>As I didn't like repeating same HTML snippets all over the place and found bare-bones HTML, CSS and JS development quite tedius, I started using <a href=\"https://reactjs.org/\">React</a> through the recommendation of a university colleague.</p>"
	},
	{
		"title": "Vue the Simple",
		"time": "2019",
		"description": "<p>I started using <a href=\"https://vuejs.org/\">Vue</a> as I found it to be much simpler and less opinionated than React.</p><p>I wrote a previous version of my portfolio in it.</p>"
	},
	{
		"title": "Full-on Compile Mode",
		"time": "2019",
		"description": "<p>During the summer break after the end of the first year of my university education I started using C++ as my go to language.</p><p>Throughout the break I watched a lot of C++ weekly by <a href=\"https://www.youtube.com/user/lefticus1\">Jason Turner</a>.</p><p>Through his videos I found out about <a href=\"https://godbolt.org/\">Godbolt</a>, and started thinking about performance while writing code.</p><p>I also developed a sweet tooth for template metaprogramming.</p>"
	},
	{
		"title": "Slow Oxydation",
		"time": "2020",
		"description": "<p>At the end of 2020 I started developing mostly in <a href=\"https://www.rust-lang.org/\">Rust</a>. I had tried it before, but never quite grasped it until then.</p><p>Macros replaced most of my need for abstraction and metaprogramming, and I had never felt as happy with a programming language as I do with Rust.</p>"
	},
	{
		"title": "SEO with Svelte",
		"time": "2021",
		"description": "<p>I wanted to rewrite my web portfolio as I thought the previous one looked terrible and due to serverless hosting <a href=\"https://en.wikipedia.org/wiki/Search_engine_optimization\">SEO</a> with Vue would never give me the results I wanted.</p><p>I ended up looking for ideal technology stack to use and as version 3 of <a href=\"https://nuxtjs.org/\">Nuxt.js</a> wasn't available, I ended up giving a shot to <a href=\"https://svelte.dev/\">Svelte</a>.</p><p>I like it the most so far, and <a href=\"https://kit.svelte.dev/\">SvelteKit</a> does everything I need out of the box with very few transitive dependencies."
	}
]
